#include <sys/types.h>
#include <signal.h>

/****************************************************************************/
			void    alrm_hand(param)
/*                      обработчик сигнала alarm
*****************************************************************************/
	int     param;          /* для соответствия прототипу */
{
extern  int     alarmed;        /* признак того, что было прерывание по alarm()*/
extern  int     alarm_set;      /* признак того, что установлен будильник */
/*==========================================================================*/
alarmed=1;

alarm_set=1;

signal(SIGALRM, alrm_hand);
alarm(1);
}
