#include "defs.h"
/****************************************************************************/
			calcpred(win,curr)
/*              Вычисление номера предыдущего пункта меню
*                                       Ревтов С.И.
*****************************************************************************/
struct  win     *win;           /*данные по запросу*/
	int     curr;           /*текущий пункт меню*/
{
	int     stop=0;
	struct  win_txt *txts;  /*тексты*/
/*==========================================================================*/
txts=win->txts;

while(!stop){ /*перебор пунктов меню, пока не будет найден допустимый*/
    if(curr>0){
      curr--;
    }else{
      curr=(win->npunkt)-1;
    }
  if(txts[curr].active) stop++;
}
return(curr);
}

