#include "defs.h"
/****************************************************************************/
			calcnext(win,curr)
/*              Вычисление номера следующего пункта меню
*                                       Ревтов С.И.
*****************************************************************************/
struct  win     *win;           /*данные по запросу*/
	int     curr;           /*текущий пункт меню*/
{
	int     stop=0;
	struct  win_txt *txts;  /*тексты*/
/*==========================================================================*/
txts=win->txts;

while(!stop){ /*перебор пунктов меню, пока не будет найден допустимый*/
  if(curr < (win->npunkt)-1)
    {
      curr++;
    }else{
      curr=0;
    }
  if(txts[curr].active) stop++;
}
return(curr);
}
