/****************************************************************************/
			int     cmp_chrs(ch1, ch2, sensitive)
/*              Сравнение сиволов ch1 и ch2 с игнорированием регистра
		на латинских
/****************************************************************************/
	int     ch1;
	int     ch2;
	int     sensitive;
{
/*==========================================================================*/
if(!sensitive){
  if(ch1>='A' && ch1<='Z') ch1|=040;
  if(ch2>='A' && ch2<='Z') ch2|=040;
}
return(ch1-ch2);
}
