/****************************************************************************/
				ext_view(name)
/*                      Обработка расширений при просмотре
/****************************************************************************/
	char    *name;
{
extern  int     in_viewer;      /* признак вызова execcmd() в режиме просмотра */
	int     retcode;
/*==========================================================================*/
in_viewer=1;
retcode=ext_action(name, ".conix.view.ext");
in_viewer=0;
return(retcode);
}
