/*
 ****************************************************************************
 *                      Всякая чушь
 ****************************************************************************
*/

#include "defs.h"
/****************************************************************************/
			mywbkgd(win, attr)
/*              Установка цвета фона attr для окна win
*****************************************************************************/
	WINDOW  *win;
	chtype  attr;
{
	int     x;
	int     y;
/*==========================================================================*/

#ifdef NCURSES /* в ncurses похоже, проблемы с закраской фона */
 wbkgd(win, attr);
 werase(win);
 wattrset(win, attr);
 for ( y=0; y < win->_maxy; y++){
   wmove(win, y, 0);
   for(x=0; x < win->_maxx; x++)
     waddch(win,' ');
 }
 wmove(win,0,0);
#else
 wbkgd(win, attr);
 werase(win);
#endif
}
