/****************************************************************************/
			name_to_out(src, targ, len)
/*                      Формирование строки для вывода имени файла
/****************************************************************************/
unsigned char   *src;           /* исходная строка */
unsigned char   *targ;          /* место, куда поместить строку*/
	int     len;            /* strlen(targ) т.е. не учитывая \0 */
{
	int     src_len;        /* длина исходной строки*/
unsigned char   *ptr;           /* для преобразования CONTROL-символов */
/****************************************************************************/
src_len=strlen(src);

if(src_len > len)
  { /* полное имя не помещается */
    strcpy(targ,"...");
    strcpy(targ+3, src+(src_len-len)+3);
  }else{ /* имя файла помещается целиком*/
    strcpy(targ, src);
  }

/* имена могут содержать всякие управляющие символы */
for(ptr=targ; *ptr; ptr++){
  if(*ptr < ' ') *ptr='?';
}
}
