/****************************************************************************/
	void    swap_bin(addr, size)
/*              Преобразование двоичных данных
*                (перестановка байтов)
*****************************************************************************/
	char *addr;
	unsigned size;
{
	char    tmp;
	char    *ptr;
/*==========================================================================*/
  ptr=addr+size-1;
  size/=2;
  while(size--) {
    tmp     = *ptr;
    *ptr--  = *addr;
    *addr++ = tmp;
  }
}
